tutorials/combustion/PDRFoam/pipeLattice/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    outer
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    seaGround
    {
        type            zeroGradient;
    }
    blockedFaces
    {
        type            zeroGradient;
    }
    mergingFaces
    {
        type            zeroGradient;
    }
    wallFaces
    {
        type            zeroGradient;
    }
    ySymmetry
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
